# 字符串类型的格式化
# <模板字符串>.format(<逗号分隔的参数>)
# 槽
print('{}:计算机{}的CPU占用率为{}%'.format('2018-10-10','C',10))

# 槽可以任意指定序号
print('{1}:计算机{0}的CPU占用率为{2}%'.format('2018-10-10','C',10))

# format()方法的格式控制
# {<参数序号:格式控制标记}
# 格式控制标记包括：
'''
<:> 引导符号
<填充> 用于填充的单个字符
<对齐> <左对齐、>右对齐、^居中对齐
<宽度> 输出宽度
<,> 数字的千位分隔符
<.n> 浮点数小数精度或字符串最大输出长度
<类型> 整数类型（b二级制,cUnicode字符,d十进制,o八进制,x十六进制小写,X十六进制大写); 浮点数类型（e科学计数小写,E科学计数大写,f普通浮点数,%百分数)
'''

print('{0:•^20}'.format('Python'))
print('{:-<25}'.format('Bite me'))
print('{:_>15}'.format('Check'))

# 数字千分符
print('{1:,.2f}, {0:,.1f}'.format(123456.7890,987654.321))
print('{0:,.2f}, {0:,.1f}'.format(123456.7890))

# 整数类型
print('{0:b}, {0:c}, {0:d}, {0:o}, {0:x}, {0:X}'.format(427))

# 浮点数类型
print('{0:e}, {0:E}, {0:f}, {0:%}'.format(23.143))